Window_NameInput.prototype.table = function() {
        return [Window_NameInput.CHS1,
                Window_NameInput.CHS2,
                Window_NameInput.CHS3,
                Window_NameInput.CHS4,
                Window_NameInput.CHS5,
                Window_NameInput.CHS6];
 };

Window_NameEdit.prototype.charWidth = function() {
    var text = '\uff21' ;
    return this.textWidth(text);
};

Window_NameInput.CHS1 =
        [ '阿','爱','安','昂','奥',  '翠','寸','挫','大','呆',
          '巴','白','般','帮','包',  '蛋','当','道','的','灯',
          '贝','本','崩','比','变',  '帝','电','吊','蝶','丁',
          '表','别','兵','并','波',  '丢','东','斗','度','短',
          '步','才','参','苍','草',  '对','顿','多','恶','恩',
          '册','层','柴','产','长',  '尔','法','番','方','飞',
          '超','车','尘','成','尺',  '分','风','夫','盖','干',
          '虫','仇','出','川','创',  '刚','高','给','根','更',
          '吹','春','次','聪','粗',  '工','狗','　','切换','确定' ];
Window_NameInput.CHS2 =
        [ '古','瓜','乖','关','光',  '肯','坑','空','口','库',
          '鬼','滚','国','哈','海',  '夸','快','宽','狂','葵',
          '汉','好','和','黑','恨',  '困','扩','拉','来','蓝',
          '亨','红','后','乎','花',  '郎','老','了','雷','冷',
          '坏','幻','黄','灰','魂',  '力','恋','凉','列','林',
          '火','基','加','见','酱',  '灵','留','龙','楼','陆',
          '交','杰','金','静','久',  '绿','乱','轮','罗','麻',
          '菊','娟','觉','君','卡',  '麦','曼','忙','猫','么',
          '开','看','康','考','克',  '美','门','　','切换','決定' ];
Window_NameInput.CHS3 =
        [ '萌','米','面','喵','灭',  '破','普','期','千','强',
          '敏','明','魔','某','姆',  '巧','切','琴','青','穷',
          '那','乃','南','闹','呢',  '秋','区','全','确','群',
          '内','能','尼','念','娘',  '然','热','人','日','荣',
          '鸟','涅','宁','牛','农',  '肉','如','软','瑞','润',
          '怒','女','暖','虐','诺',  '弱','撒','塞','散','丧',
          '哦','欧','帕','派','盘',  '扫','色','森','僧','沙',
          '胖','炮','培','盆','朋',  '晒','山','上','少','手',
          '皮','片','票','品','平',  '树','刷','　','切换','決定' ];
Window_NameInput.CHS4 =
        [ '帅','双','水','顺','说',  '小','歇','心','星','凶',
          '斯','宋','瘦','苏','酸',  '修','虚','宣','血','寻',
          '岁','孙','索','塔','太',  '亚','言','羊','妖','夜',
          '弹','糖','桃','特','疼',  '衣','音','樱','勇','游',
          '体','天','条','铁','停',  '羽','圆','月','云','扎',
          '同','头','土','团','推',  '仔','赞','脏','早','泽',
          '豚','拖','瓦','外','丸',  '曾','渣','战','张','照',
          '王','伪','文','翁','我',  '者','真','正','之','中',
          '无','西','下','先','香',  '周','朱','　','切换','決定' ];
Window_NameInput.CHS5 =
        [ '爪','转','装','坠','准',  '缠','朝','扯','陈','沉',
          '卓','子','总','走','足',  '尘','池','赤','纯','茨',
          '钻','尊','作','一','二',  '从','崔','打','戴','单',
          '三','四','五','六','七',  '到','德','弟','地','底',
          '八','九','十','橙','黄',  '掉','爹','定','豆','度',
          '紫','银','艾','哀','傲',  '毒','段','队','耳','范',
          '霸','爸','败','班','宝',  '腐','改','哥','公','广',
          '爆','北','毕','便','冰',  '甲','号','河','化','活',
          '伯','搏','布','不','财',  '尽','姐','　','切换','決定' ];
Window_NameInput.CHS6 =
        [ 'Ａ','Ｂ','Ｃ','Ｄ','Ｅ',  'ａ','ｂ','ｃ','ｄ','ｅ',
          'Ｆ','Ｇ','Ｈ','Ｉ','Ｊ',  'ｆ','ｇ','ｈ','ｉ','ｊ',
          'Ｋ','Ｌ','Ｍ','Ｎ','Ｏ',  'ｋ','ｌ','ｍ','ｎ','ｏ',
          'Ｐ','Ｑ','Ｒ','Ｓ','Ｔ',  'ｐ','ｑ','ｒ','ｓ','ｔ',
          'Ｕ','Ｖ','Ｗ','Ｘ','Ｙ',  'ｕ','ｖ','ｗ','ｘ','ｙ',
          'Ｚ','（','）','！','～',  'ｚ','辣','狼','劳','凉',
          '０','１','２','３','４',  '流','隆','路','鲁','妙',
          '５','６','７','８','９',  '鸣','命','木','男','逆',
          '镜','巨','绝','控','酷',  '气','赵','　','切换','決定' ];